/* ---------------------------------- 7.10 ---------------------------------- */
/* 2와 100 사이에 있는 모든 소수(prime number)를 찾는 프로그램을 작성하라. 
정수가 소수가 되려면 1과 자기 자신만을 약수로 가져야 한다. */

#include <stdio.h>

int main(void){
    int i=1,a=0;

    while (i<100) 
    {
        i+=1; //1씩 증가
        for (int j=1;j<=i;j++){ //1부터 자기 자신까지
            if (i%j==0) a=a+1; //나누어 떨어지면 a값 추가
        }
        if (a>2) { //소수의 약수는 2개이므로 a값이 2이상일 경우
            a=0; //초기화
            continue; //제외
            }
        else { //a==2일 경우
            printf("%d ",i); //추가
            a=0; //초기화
        }
    }
    return 0;   
}

    /*
    for(int i=2;i<=100;i++){
        for(int j=1;j<=i;j++){
            if (i%j==0) a=a+1;
            if (a==2) {
                printf("%d ",i);
                a=0;
                }
            else if (a>2) a=0;
                  
        }
    }*/