/* ---------------------------------- 7.12 ---------------------------------- */
/* 컴퓨터는 막대 그래프를 그리는 데도 사용된다. 
사용자로부터 1부터 50사이의 숫자를 입력받아서 숫 자만큼의 별표를 출력하는 프로그램을 작성하라. 
음수가 입력되면 종료한다. 막대는 세로로 그려지게 된다. */

#include <stdio.h>

int main(void)
{
    int a=1;
    
    while(a>0) //양수일 경우 반복
    {
        if(a<0) break; //음수일 경우 종료
        else {
            printf("막대의 높이(종료: -1): "); scanf("%d",&a); //입력값
            
            for(int i=1; i<=a; i++){ //입력받은 수 만큼 반복해서 출력
                printf("*");    
            }
            printf("\n"); //문단 변경
        }   
    }
    
   return 0;
}