/* ---------------------------------- 7.14 ---------------------------------- */
/* 피보나치 수열은 다음과 같이 정의되는 수열이다.
f0=0
f1=1
fi+1=fi+fi-1 for i=1,2,...
피보나치 수열에서는 앞의 2개의 원소를 합하여 뒤의 원소를 만든다. 
피보나치 수열은 컴퓨터에서도 탐색 문제 등에 사용되기도 한다. 피보나치 수열을 생성하여 출력하는 프로그램을 작성하여보자.
*/

#include <stdio.h>

int main(void){
    int a=0,b=1,c,d=0,x;

    printf("몇번째 항까지 구할까요? "); scanf("%d",&x);
    while (d<=x)//x번째 항 까지
    {
       printf("%d,",a);
       
        c=a+b; //c=1 -> c=2 -> c=3
        a=b; //a=1(두번째 항) -> a=1(세번쨰 항) -> a=2(네번째 항)
        b=c; //b=1 -> b=2 -> b=3
  
        d+=1; //몇 번째 항인지 세기 
    }
    
    return 0;
}