/* ---------------------------------- 7.20 ---------------------------------- */
/* NIM 게임을 구현하여보자. 스틱들의 뭉치를 가정한다.
사용자와 컴퓨터는 번갈아서 스틱 뭉치에서 0개에서 3개 사이로 스틱을 가져갈 수 있다. 
마지막 스틱을 가져가는 사람이 지는 게임이다. 스틱의 초기 개수는 12개라고 하자. 
NIM 게임에서는 전략이 있으나 여기서는 전략은 전혀 고려하지 않는다. 
컴퓨터는 무조건 9부터 3 사이의 난수 를 발생시켜서 스틱을 가져간다. 
발생된 난수가 현재 스틱 개수보다 크면 스틱 개수로 제한한다. */

#include <stdio.h>
#include <stdlib.h>

int main(void){
    int u,c,s=12;
    char a;

    do
    {
        printf("현재 스틱의 개수 : %d개\n",s);
        printf("몇개의 스틱을 가져가시겠습니까? : "); scanf("%d",&u);

        if (u>3) {
            printf("스틱은 0개에서 3개사이로 가져갈 수 있습니다.\n");
            printf("몇개의 스틱을 가져가시겠습니까? : "); scanf("%d",&u);
            s=s-u;
            }
        else if (u>s) {
            printf("현재 남아있는 스틱 개수를 초과하였습니다.\n");
            printf("현재 남아있는 스틱의 개수는 %d개 입니다. \n계속 진행할 경우 스틱을 전부 가져가게 됩니다. 계속 진행하시겠습니까?(Y/N) :",s);
            scanf("%c",&a);
            if (a=='Y') printf("게임이 종료 되었습니다. 승자는 컴퓨터 입니다.");
            else if (a=='N') {
                printf("몇개의 스틱을 가져가시겠습니까? : "); scanf("%d",&u);
                s=s-u;
                }
        }
        else {
            if (s-u==0) {
                printf("게임이 종료 되었습니다. 승자는 컴퓨터 입니다.");
                s=s-u;
            }
            else s=s-u;
            }

        c=rand()%4;
        
        if (c>s) {
            printf("컴퓨터는 %d개의 스틱을 가져갔습니다.\n",s);
            printf("게임이 종료 되었습니다. 승자는 사용자 입니다.");
        }
        else {
            printf("컴퓨터는 %d개의 스틱을 가져갔습니다.\n",c);
            printf("\n");
            
            if (s-c==0) {
                printf("게임이 종료 되었습니다. 승자는 사용자 입니다.");
                s=s-c;
            }
            else s=s-c;
        }


    } while (s!=0);
    return 0;
}