/* ---------------------------------- 6.12 ---------------------------------- */
/* 2자리 숫자로 이루어진 복권이 있다. 사용자가 가지고 있는 복권 번호가 2자리 모두 일치하면 100만 원을 받는다. 
2자리 중에서 하나만 일치하면 50만 원을 받는다. 하나도 일치하지 않으면 상금은 없다.
복권 당첨 번호는 난수로 생성하고 사용자의 입력에 따라서 상금이 얼마인지를 출력하는 프로그램을 작성하라. */

#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int a,b=rand()%(99-10+1)+10; //10부터 99까지

    printf("복권 번호를 입력하시오(0에서 99사이):"); scanf("%d",&a);

    printf("당첨번호는 %d입니다.\n",b);

    if(a/10==b/10) //첫번째 숫자 일치
    {
        if(a%10==b%10) printf("상금은 100만원입니다."); //두번쨰 숫자 일치
        else printf("상금은 50만원입니다."); //두번쨰 숫자 불일치
    }
    else if(a%10==b%10) //두번쨰 숫자 일치
    {
        if(a/10==b/10) printf("상금은 100만원입니다."); //첫번째 숫자 일치
        else printf("상금은 50만원입니다."); //첫번째 숫자 불일치
    }
    else printf("상금은 없습니다."); //모두 불일치

    return 0;
}