/* ----------------------------------- 6.3 ---------------------------------- */
/* 컴퓨터와 가위, 바위, 보 게임을 하는 프로그램을 작성하라. 
컴퓨터는 사용자에게 알리지 않고 가위, 바위, 보 중에서 임의로 하나를 선택한다. 
사용자는 프로그램의 입력 안내 메시지에 따라서, 3개 중에서 하나를 선택하게 된다. 
사용자의 선택이 끝나면 컴퓨터는 누가 무엇을 선택하였고 누가 이겼는지, 비겼는지를 알려준다. */

#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int a,b=(rand()%3+1); //랜덤으로 1,2,3중 하나 받기
    //char c;
    printf("(1:가위 2:바위 3:보) 중에서 하나를 선택하시오: "); scanf("%d",&a);
    
    switch(b)
    {
        case 1:
            printf("컴퓨터는 가위를 선택하였습니다.\n");
            break;
        case 2:
            printf("컴퓨터는 바위를 선택하였습니다.\n");
            break;
        case 3:
            printf("컴퓨터는 보를 선택하였습니다.\n");
            break;
    }
     /*
    if(b==1) printf("컴퓨터는 가위를 선택하였습니다.\n");
    else if(b==2) printf("컴퓨터는 바위를 선택하였습니다.\n");
    else if(b==3) printf("컴퓨터는 보를 선택하였습니다.\n");
     
    char에는 한글을 담을 수 없음
    if(b==1) c = '가위';
    else if(b==2) c = '바위';
    else(b==3) c = '보';

    printf("컴퓨터는 %c를 선택하였습니다.\n",c);
    */
   
    if(a==1) //사용자 가위
    {
        if(b==2) printf("컴퓨터가 이겼습니다."); //컴퓨터 바위
        else if(b==3) printf("사용자가 이겼습니다."); //컴퓨터 보
        else printf("비겼습니다."); //컴퓨터 가위
    }
    else if(a==2) //사용자 바위
    {
        if(b==1) printf("사용자가 이겼습니다."); //컴퓨터 가위
        else if(b==3) printf("컴퓨터가 이겼습니다."); //컴퓨터 보
        else printf("비겼습니다."); //컴퓨터 바위
    }
    else //사용자 보
    {
        if(b==1) printf("컴퓨터가 이겼습니다."); //컴퓨터 가위
        else if(b==2) printf("사용자가 이겼습니다."); //컴퓨터 바위
        else printf("비겼습니다."); //컴퓨터 보
    }
    return 0;
}