/* ----------------------------------- 6.8 ---------------------------------- */
/* 놀이 공원의 자유이용권의 가격을 계산하는 프로그램을 작성하여보자. 입장료는 다음과 같은 조건으로 결정된다. 
현재 시간과 사용자의 나이를 입력받아서 지불하여야 하는 요금을 화면에 출력한다. */

#include <stdio.h>

int main(void)
{
    int a,t,p;

    printf("현재 시간과 나이를 입력하시오(시간 나이):"); scanf("%d %d",&a,&t);
    if(t<=17) //5시 이전
    {
        if(3<=a<=12 && a>=65) //소인
        p=25000;
        else //대인
        p=34000;
    } 
    else p=10000; // 5시 이후

    printf("요금은 %d원 입니다.",p);

    return 0;
}