/* ----------------------------------- 7.9 ---------------------------------- */
#include <stdio.h>

int main(void){
    int a,b,c,i=1;

    printf("정수 2개를 입력하시오: "); scanf("%d %d",&a,&b);

    if(a>b){ //a가 큰 경우
        if ((a*i)%b==0) printf("최소공배수는 %d입니다.",a); //a가 b로 나누어 떨어질 경우 a가 최소공배수
        else{ //a가 b로 나누어 떨어지지 않을 경우
            while ((a*i)%b!=0){ //a에 i를 곱헤서 b로 나누어 떨어질 때 까지 반복
            i+=1; //1씩 증가
            c=(a*i)%b; //a배수를 b로 나눈 값. 나누어떨어지면 c는 0임
            if(c==0) printf("최소공배수는 %d입니다.",a*i); //c가 0인 경우 a의 i배수 값이 최소공배수
            }
        }
        
    }
    else{ //b가 큰 경우 코드 진행은 위와 동일
        if ((b*i)%a==0) printf("최소공배수는 %d입니다.",b); 
        else{
            while ((b*i)%a!=0){
            i+=1;
            c=(b*i)%a;
            if(c==0) printf("최소공배수는 %d입니다.",b*i); 
            }
        } 
    }
    return 0;
}